3_week/rails-intro/app/controllers/movies_controller.rb

  def index
    @movies = Movie.find(:all, :order => params[:id])
    # @movies = Movie.where(rating: "PG").find(:all, :order => params[:id])
    @all_ratings = Movie.ratings
    @rating_list = params[:ratings]
    # @movies = Movie.find(:all)
    if @rating_list
      @first_if = "first if"
    #   # @movies = Movie.where(rating: @rating_list.keys)
       # @movies = Movie.where(rating: "PG").find(:all, :order => params[:id])
       @movies = Movie.where(rating: params[:ratings].keys).find(:all, :order => session[:sort])#.sort_by{|movie| movie.send(params[:id])}
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" IN (0, 0, 0)
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IS NULL AND "movies"."order" IS NULL