3_week/rails-intro/app/controllers/movies_controller.rb

  def show
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(params[:id]) # look up movie by unique ID Movie.find(:all, :order => params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]

  def index
    session[:sort] = params[:sort] if params[:sort].present?
    session[:ratings] = params[:ratings] if params[:ratings].present?
    @all_ratings = Movie.ratings
    if (!params[:sort].present? && session[:sort].present?) || (!params[:ratings].present? && session[:ratings].present?)
      flash.keep
      redirect_to movies_path(:sort => session[:sort], :ratings => session[:ratings])
    end
    params[:ratings] = Hash[ @all_ratings.zip( [].fill("1", 0, @all_ratings.size) ) ] if !params[:ratings].present?
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R', 'NC-17') ORDER BY release_date